In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv("salaries.csv")
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,EN,FT,Azure Data Engineer,100000,USD,100000,MU,0,MU,S
1,2020,EN,CT,Staff Data Analyst,60000,CAD,44753,CA,50,CA,L
2,2020,SE,FT,Staff Data Scientist,164000,USD,164000,US,50,US,M
3,2020,EN,FT,Data Analyst,42000,EUR,47899,DE,0,DE,L
4,2020,EX,FT,Data Scientist,300000,USD,300000,US,100,US,L
...,...,...,...,...,...,...,...,...,...,...,...
37229,2024,SE,FT,Data Analyst,170000,USD,170000,US,100,US,M
37230,2024,SE,FT,Data Scientist,195500,USD,195500,US,100,US,M
37231,2024,SE,FT,Data Scientist,141300,USD,141300,US,100,US,M
37232,2024,SE,FT,Data Engineer,139810,USD,139810,US,0,US,M
37233,2024,SE,FT,Data Engineer,95325,USD,95325,US,0,US,M